Revit 2027 API
ParameterTypeId.ExtrusionDepthParam Property
 "Depth"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ExtrusionDepthParam { get; }
Public Shared ReadOnly Property ExtrusionDepthParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ExtrusionDepthParam {
	ForgeTypeId^ get ();
}
static member ExtrusionDepthParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace